app/views/favorites/_favorite-btn.html.erb

<% if brand.favorited_by?(current_user) %>
  <%= link_to brand.favorites.count, brand_favorites_path(brand), method: :delete, remote: true, class: "fas fa-heart unlike-btn" %>
<% else %>
  <%= link_to brand.favorites.count, brand_favorites_path(brand), method: :post, remote: true, class: "far fa-heart like-btn"  %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."brand_id" = ?  [["brand_id", 1]]