app/controllers/brands_controller.rb

INSERT INTO "brands" ("user_id", "prefecture_id", "brand_name", "jan", "body", "brand_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @brand = Brand.new(brand_params)
    @brand.user_id = current_user.id
    if @brand.save

SELECT  "brands".* FROM "brands" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @brands = Brand.all.page(params[:page]).per(10)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."brand_id" = ?  [["brand_id", 1]]
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @brand = Brand.find(params[:id])
    @comment = Comment.new
    @comments = Comment.where(params[:id])
    if @brand.comments.blank?
      @average_rate = 0
    else
      @average_rate = @brand.comments.average(:rate)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @brand = Brand.find(params[:id])

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "brands" SET "brand_image_id" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["brand_image_id", "4a4157b8b987c0c3f4cd7ae6042bf09b959e823ae96e2e2bfd3950e40618"], ["updated_at", "2021-11-19 13:18:12.909133"], ["id", 3]]
---
  def update
    @brand = Brand.find(params[:id])
    if @brand.update(brand_params)