app/controllers/comments_controller.rb

  def create
    @brand = Brand.find(params[:brand_id])
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.brand_id = @brand.id
    @comment.save
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "brand_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["brand_id", 1], ["comment", "大好き"], ["created_at", "2021-11-19 14:08:31.227932"], ["updated_at", "2021-11-19 14:08:31.227932"]]

  def destroy
    @brand = Brand.find(params[:brand_id])
    @comment = @brand.comments.find(params[:id])
    Comment.find_by(id: params[:id]).destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]