app/controllers/favorites_controller.rb

  def create
    @brand = Brand.find(params[:brand_id])
    favorite = current_user.favorites.new(brand_id: @brand.id)
    favorite.save
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "brand_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["brand_id", 1], ["created_at", "2021-11-20 07:21:34.806308"], ["updated_at", "2021-11-20 07:21:34.806308"]]

  def destroy
    @brand = Brand.find(params[:brand_id])
    favorite = current_user.favorites.find_by(brand_id: @brand.id)
    favorite.destroy
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."brand_id" = ? LIMIT ?  [["user_id", 2], ["brand_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 5]]