app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "73fdf0e3b44dca5d147f9d9d3f7bc2e8deac4c359e2ca70f85dba80aaf78"], ["updated_at", "2021-11-19 08:40:22.328094"], ["id", 1]]