app/views/brands/show.html.erb

        <!--コメント欄-->
          <p class= "comments-count">コメント数：<%= @brand.comments.count %></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."brand_id" = ?  [["brand_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."brand_id" = ?  [["brand_id", 1]]